{"question": "マリオミラーのスマッシュの確定反撃について教えて", "gold_answer": "マリオの各種スマッシュへの確定反撃についてお答えします。まず、上スマッシュはガードに対して-20F、ガーキャン上スマ、ガーキャン掴み、ガード解除ダッシュ掴み、ガード解除各種強攻撃、ガード解除弱攻撃が確定します。撃墜が狙える%で密着状況なら上スマ、撃墜が狙えないならダッシュ掴みや下強…といった具合で、リターンをしっかり意識してガードしましょう。　このように、具体的なデータを示し、リターンが高いものを提示する。", "user_id": "486569259195957269", "timestamp": "2026-01-21T12:39:20.097739"}
{"question": "マリオ対策教えて", "gold_answer": "element_number:1 主要な技の性能把握を推進する方針はgood。上スマッシュの項目、ガードキャンセル=ガーキャンは全キャラ共通で上Bと上スマッシュで行う場合追加の3Fはかからない(最重要事項)ので、ガーキャン上スマは9Fで出せる。他のガーキャン行動に関しては、ガーキャンジャンプから攻撃を出す場合はそのキャラのジャンプ踏切フレーム＋攻撃発生フレームがガーキャンジャンプ攻撃の発生フレームとなる。　　復帰阻止への対策について、まずマリオの上Bについてだが、スーパーJという技名は正確ではないため今後すべて上Bの表記で良い。そしてマリオの上ｂは復帰阻止目的で振ってくることはあまりない。唯一あるとすれば、お互いほぼ同時に崖つかまりを狙った際に、マリオが下から上Ｂで突き上げ、崖メテオを狙うことができるタイミングのみである。これは復帰阻止を行うついでに撃墜をマリオ側が狙う選択肢である。対策は復帰技(上Ｂ)を入力した際に、受け身も少しだけタイミングを遅らせて長押しし、その直後もう一度上Ｂを押しておくことである。まず上Ｂが出たのち、受け身が成立した場合は直後に上Ｂが出る、技を当てられたが立ち吹っ飛びだったために受け身展開にならなかった場合は先行入力の関係で受け身ボタン=シールドボタンより上Ｂが優先され、回避が暴発することなく復帰技が出て崖に捕まることができる。この受け身＝シールドボタンの直後に上Ｂを押し、シールドとＢボタン両方を長押しするテクニックは受け身が必要かどうかわからない崖メテオが狙われそうだが反応できない状況において非常に有用である。element_number:2 コンボへの対処(ずらし)　ベクトル変更とずらしの概念を混同しているのは悪い回答。ベクトル変更はコンボが繋がりづらくなるようにする、あるいは繋がったとしてもダメージを低く抑えられる、もしくは撃墜から逃れられる方向に行うのがセオリーである。ずらしに関して言及する必要があるのは、ベクトル変更が効かない立ち吹っ飛び時(弱い吹っ飛び)の時である。ずらしは立ち吹っ飛び時に行える唯一の防御手段である。また、多段技に被弾しているときは、ずらしができるヒットストップFが多くあるため、防御手段としてはヒットストップ中に半月ずらし→吹っ飛ぶ瞬間にベクトル変更を行うことが重要である。　なお、マリオの空上運びコンボへの対処として、基本的に台から離れる方向にベクトル変更を行う(マリオの空上の吹っ飛ばし確度に対して垂直の方向にベクトル変更を行うことを手段とし、撃墜に向かうコンボ締めの空下や上Bに対してはそれぞれ多段技のため下ずらし+元の吹っ飛びに対して垂直を作るように斜め下にベクトル変更を行うのが最善である。)  element_number:3 着地狩りの意識　マリオの弱点が着地である旨に触れられているのはよい。落下速度があまり早くない、下方向に判定が広い技を持たない=暴れ着地が弱いという要件をマリオは満たしている。しかし、着地を強くする要素である空中横移動の速さをマリオは持っている。これへの対処は、マリオの空中横移動に対してジャンプで追いかけず、地上で走って軸あわせをしてから強い判定の技で空対空を行い着地狩りを行うことである。追いついて、殴ることが重要である。マリオは、下b=ポンプで暴れることは絶対にない。ポンプは攻撃判定を真下に持たないからである。　element4:ダメージ%の把握の項目はとてもよくできている。マリオのコンボ始動技を食らうと即死させられてしまう始動位置と%の組み合わせを覚えておくとよりよい対策となる点は明記した方が良い。コンボへの対策は始動技への対処、食らう側の%、台&バーストラインとの位置関係が変数である。　崖の攻防の項目について、復帰阻止展開と崖上がり狩りの展開が混同されていて、とても良くない。復帰阻止は積極的に狙うべきだが、マリオの上Bの出だし無敵に注意し、上Bの軌道上に下方向に判定が強めの技を置くことが書けるとなお良い。復帰技の性質(無敵有無や攻撃判定位置)を加味して、復帰阻止が出来る技選択を各キャラで模索できるように言及すると良くなる。崖上のマリオは崖狩りでポンプを使わない。マリオのポンプは差し合いでジャンプ置きが多い相手や、自分からジャンプで離れて着地狩り展開を拒否しようとする相手に対して有効な選択肢であり、この技自体は非常に有用であるが使い方が特殊である。", "user_id": "486569259195957269", "timestamp": "2026-01-21T23:32:50.680586"}
{"question": "キャラ対策で考えるべきことってなに？", "gold_answer": "全体を通してとても良い。試合における各要素=崖狩り、崖上がり、復帰、復帰阻止、着地、着地狩り、差し合い、撃墜、撃墜拒否それぞれでやるべきことがはっきりしている状態が理想であり、自分の理解に穴がある要素かつ、勝ち筋や負け筋に繋がるポイントを重点的に理解していくことが対策において必須である。", "user_id": "486569259195957269", "timestamp": "2026-01-22T01:09:58.564112"}
